<p>
    <span class="bold">
        Wie testet Ihr Scala-Code ?
    </span>
</p>
<p>
    <span>
        Wir haben uns verschiedene Frameworks angesehen und uns f&uuml;r
    </span> <span>
    <a href="http://www.scalatest.org/">
        ScalaTest</a>
</span> <span>entschieden. Es ist &uuml;berschaubar und schr&auml;nkt den Stil, in dem man die Tests schreiben will, nicht ein. Wir benutzen es auch um unser Java SDK zu testen, das mit dem Backend-API kommuniziert. Ich denke, ScalaTest bietet eine ganze Reihe von M&ouml;glichkeiten, selbst f&uuml;r reine Java-Projekte.
        Wir verwenden ebenfalls <a href="https://github.com/rickynils/scalacheck">ScalaCheck</a> zur Automatisierung von einigen Tests; zus&auml;tzlich unterst&uuml;tzt uns noch</span>
<a href="https://github.com/paulbutcher/ScalaMock">
        ScalaMock</a>.
</p> <p>
    <span>
        Au&szlig;erdem verwenden wir einen Continuous Integration Server auf Basis von <a href="http://jenkins-ci.org/">Jenkins</a>, um unseren Projektquellcode nach jedem
    </span> <span class="italic">git push</span> <span>
    zu testen. Er ruft einfach den SBT
</span> <span class="italic">
    clean test
</span> <span>auf und die Testergebnisse werden dann als XML exportiert, so dass Jenkins sie auswerten und ausgeben kann. Alles in allem, eine problemlose Integration.</span>
</p>

<p>
    <span class="bold">
        Welche Schwachstellen hast du identifiziert ?
    </span>
</p> <p>
    Ich habe ja schon die lange Zeit zur Kompilierung erw&auml;hnt, aber dazu kommen noch zwei Dinge, die mit dem Versionieren zusammenh&auml;ngen: bin&auml;re Kompatibilit&auml;t und die JAR-H&ouml;lle. Das sind zwei separate Probleme und die gr&ouml;&szlig;ten Schwachstellen. Die bin&auml;re (In-)Kompatibilit&auml;t zwischen den verschiedenen Scala-Versionen ist ein wohlbekanntes Problem in der Community. Wahrscheinlich ist es der Hauptgrund daf&uuml;r, dass die Libraries immer f&uuml;r spezielle Scala-Versionen ver&ouml;ffentlicht werden, was dann allerdings zu Versionierungsschwierigkeiten f&uuml;hrt. Beispielsweise hat der Autor der
    <a href="http://dispatch.databinder.net/">
        Dispatch HTTP</a>-Bibliothek gesagt, er k&ouml;nne sich nicht auf
    Scalaz verlassen, da er &auml;ltere Scala-Versionen mit neuen Dispatch-Releases unterst&uuml;tzen will, was neue Releases von Scalaz aber nicht tun.
</p> <p>
    <span>
        Das n&auml;chste Problem ist die sogenannte JAR-H&ouml;lle, die jedoch mit der JVM, nicht Scala selbst zusammenh&auml;ngt. Klar, SBT kann die richtigen Versionen der Abh&auml;ngigkeiten f&uuml;r dich verwalten. W&auml;hrend der Laufzeit hat man jedoch keine Ahnung von Klassen-Versionen. Wenn die JVM eine Klasse laden muss, sucht sie einfach nach dem Namen und wenn sich dann eine falsche Version der Klasse auf dem Klassenpfad befindet, geht das Programm meist sowieso krachen. Um das zu vermeiden, bauen wir einen vollst&auml;ndigen Klassenpfad f&uuml;r die Start-Skripte unseres Webservices (z.B <span class="italic">-cp service_2.9.1-0.1.jar unfiltered_2.9.1-0.6.4.jar</span>) unter Verwendung einer modifizierten Version des
    </span>
    <a href="https://github.com/sbt/sbt-native-packager">
        SBT Packaging-Plugin</a>.</p>

<p>
    <span class="bold">
        Was gef&auml;llt dir pers&ouml;nlich an Scala ?
    </span>
</p> <p>

    Ich mag die Ausdrucksf&auml;higkeit von Scala, wir haben zum Beispiel eine
    interessante Library selbst gebaut: Eine typsichere Abfrage-API f&uuml;r MongoDB. Wir hatten zuerst
    <a href="https://github.com/foursquare/rogue">
        Rogue
    </a> erwogen, aber es dann doch als zu aufdringlich befunden, denn es macht Annahmen bez&uuml;glich des Domainmodells. Also haben wir einfach selbst eine Abfrage-DSL entworfen. Es erinnert ein bisschen an LINQ aus .NET. Es zu implementieren hat auch nicht lang gedauert. Du hast alle MongoDB-Funktionen und kannst sie dann via DSL <span class="italic">(Anm.: domänenspezifische Sprache)</span> zusammensetzen. Das beste ist jedoch: Alles ist typsicher, denn wenn eine Abfrage ein falsches Feld oder eine falsche Funktion nutzt, wirft der Kompiler den Fehler und es gibt nicht erst zur Ausf&uuml;hrung eine b&ouml;se &Uuml;berraschung. Ein gutes Beispiel daf&uuml;r, wie Scala sich an die Problemdom&auml;ne anpassen kann. Zum Beispiel:

</p>
<p>
    <script src="https://gist.github.com/4474462.js"> </script>
</p>
<p>
    <span>
        Java- und C#-Entwicklungsumgebungen haben Funktionen zur Generierung von Konstruktoren und Zugriffsmethoden - in Scala brauchst du das nicht. Das Verh&auml;ltnis von n&uuml;tzlichem Code zu Boilerplate ist sehr gut.
    </span>
</p>  <p>
    <span>
        Abgesehen von der Sprache selbst, mag ich auch die Scala-Community; sie ist wirklich aktiv und mir gef&auml;llt, was alles zum Release von 2.10 beigetragen wurde. Ich denke, es ist auf einem guten Weg.
    </span>
</p>
<p>
    <span class="bold">
        Was h&auml;ltst du vom neuen Macros-Feature in Scala 2.10 ?
    </span>
</p> <p>
    <span>
        Nun ja, Makros generieren Code, daher sind sie eine gute Hilfe bei Aufgaben, die typischerweise Code-Generation erfordern, wie das Arbeiten mit Modellen, Serialisierung usw. Ich habe dieses neue Feature noch nicht im Detail ausprobiert, aber es k&ouml;nnte bei unserer Abfrage-DSL hilfreich sein, weil man dann nicht mehr manuell ein Mongo-View f&uuml;r das Domainmodell spezifizieren m&uuml;sste. Ich denke aber Typesafe&rsquo;s
    </span> <span>
    <a href="http://slick.typesafe.com/">
        Slick</a>
</span> <span>hat das bereits implementiert.</span>
</p>

@cta()

<p>
    <span class="bold">
        Nutzt ihr den Support den Typesafe anbietet ?</span>
</p> <p>
    <span>
        Bislang haben wir den noch nicht gebraucht, nein. Wenn die Anwendung online ist und Schwierigkeiten auftreten, ist man sicher gern bereit zu zahlen. Aber solange das noch nicht der Fall ist, halte ich es nicht f&uuml;r notwendig. Wir sind bisher auf nichts gesto&szlig;en, wof&uuml;r wir die L&ouml;sung nicht selbst herausfinden konnten.
    </span>
</p>

<p class="bold">
    Vielen Dank für das Interview, Martin.
</p>

<br/>